Repository: Swader/diffbot-php-client-docs
Catalog: locale/*/LC_MESSAGES/overview.po
Languages: hr

source: Overview
hr: Pregled

source: `Diffbot`_ is a visual machine learning AI which processes renders of web pages to generate structured JSON entities.
hr: `Diffbot`_ je softverski robot, spoj umjetne inteligencije i strojnog ucenja, koji vizualno procesuira web stranice i vraca strukturirane JSON podatke o istima.

source: In other words, you give Diffbot a URL and it returns human-readable data about it, but doesn't rely on what it finds in the source code - rather, it reads the renders like humans do, visually extracting the human-directed content to provide reliable information about what's actually being said on the page being processed. In that effect, it is relatively untrickable by over-optimized SEO meta content.
hr: Drugim rijecima, Diffbotu se daje URL, te on vraca podatke koji su citljivi ljudima. Razlika Diffbota i tradicionalnih *crawlera* je u tome sto Diffbot ne ovisi o izvornom HTML kodu koji nalazi na danim web stranicama, vec ih vizualno promatra i pokusava dokuciti ljudima bitne elemente, te iste pretvoriti u vrstu podataka koju krajnji korisnik lako konzumira u svojim aplikacijama. Samim time, Diffbot je relativno imun na SEO pretjerivanja i sulude kolicine meta tagova u HTML kodu koji se obicno koriste kako bi se prevario Google i preferirao neke stranice vise od drugih.

source: Diffbot exposes its services via a set of API endpoints.
hr: Diffbotovim servisima se pristupa kroz set definiranih API tocaka.

source: `Other tutorials <http://www.sitepoint.com/tag/diffbot/>`_
hr: `Ostali tutorijali <http://www.sitepoint.com/tag/diffbot/>`_

source: Diffbot PHP Client
hr: Diffbotov PHP klijent

source: The Diffbot PHP Client is the official PHP wrapper for the API endpoints Diffbot provides.
hr: Diffbotov PHP klijent je sluzbeni PHP *wrapper* za koristenje API tocaka.

source: By using the PHP client, the developer can interact with both the APIs and the returned entities in an object oriented manner, rather than parse JSON and extract data manually. The PHP client uses Guzzle to issue requests to the API. It is currently built on top of Guzzle 5, and there are no immediate plans to transition to the feature-lacking version 6.
hr: Koristenjem PHP klijenta, developeri s lakocom upravljaju kako API tockama, tako i samim entitetima koje API tocke vracaju nakon izvrsenih poziva. To uvelike olaksava konzumiranje vracenih podataka, jer odstranjuje sloj procesuiranja JSON strukture, i pruza direktni pristup na vrijednosti vracenih objekata. PHP klijent koristi Guzzle za slanje poziva na API tocke - verzija koja se koristi je Guzzle 5, i nema planova u bliskoj buducnosti za prelaz na svojstvima siromasniju verziju 6.

source: Quickstart
hr: Brzi pocetak

source: Install via Composer::
hr: Instalirajte putem Composera::

source: Configure the API call with some setters (all will be explained in this documentation) and issue the call::
hr: Podesite API poziv prema svojim potrebama pomocu *settera* (svi ce setteri biti detaljno objasnjeni u ovoj dokumentaciji), te posaljite poziv::

source: Consume the resulting data entity any way you see fit::
hr: Upotrijebite dobivene podatke na koji god nacin vam odgovara::

source: To read more about Diffbot, see the `official documentation <https://www.diffbot.com/dev/docs/>`_, or some of the following tutorials:
hr: Da biste saznali vise o Diffbotu kao servisu, pogledajte `sluzbenu dokumentaciju <https://www.diffbot.com/dev/docs>`_ ili neke od sljedecih tutorijala:

source: Create a Diffbot instance, provide a token, specify the URL you want to process, and use all this to create an instance of the API endpoint::
hr: Kreirajte novu Diffbot instancu, dajte joj token, definirajte URL koji zelite obraditi, te napokon iz svega kreirajte instancu API tocke koju cete zvati::

source: Quicklinks
hr: Brzi linkovi

source: Here's a list sub-guides for this PHP client which may be useful depending on your specific needs:
hr: Slijedi popis linkova na specificne aspekte ovog klijenta, ovisno o vasim potrebama:

source: :doc:`Products API <api-product>` - if you need to parse online products like webshop content, auction site pages, etc.
hr: :doc:`Products API <api-product>` - ukoliko trebate obraditi online proizvode, web shopove, stranice na aukcijskim sjatovima, itd.

source: :doc:`Articles API <api-article>` - if you need to parse online posts like news sites, blogs, tutorials, and other prose.
hr: :doc:`Articles API <api-article>` - ukoliko trebate obraditi clanke, novosti, blog postove, i slicno.

source: :doc:`Discussion API <api-discussion>` - for parsing forum topics, comment threads, and other back-and-forth forms of communication.
hr: :doc:`Discussion API <api-discussion>` - za obradu tema na forumima, komentara, te drugih vrsta dvosmjerne komunikacije.

source: :doc:`Analyze API <api-analyze>` - If you don't know what you're parsing, and want to rely on Diffbot's intuition to figure it out and auto-apply the correct API (one of the above).
hr: :doc:`Analyze API <api-analyze>` - ukoliko ne znate sto cete obradjivati, te se zelite pouzdati u Diffbotovu intuiciju. Diffbot ce dati sve od sebe da sam shvati o kakvom se sadrzaju radi, te ce primjeniti jedan od odgovarajucih API-ja.

source: :doc:`Image API <api-image>` - if you're planning to parse an image-heavy site and want them all returned, along with extra data. Think galleries, pinterest pages, instagram...
hr: :doc:`Image API <api-image>` - ako planirate obraditi stranice koje sadrze mnogo grafickih elemenata, te zelite podatke o tim elementima. Primjeri su galerije, Pinterest stranice, Instagram, itd.

source: :doc:`Custom API <api-custom>` - if you built your own API on Diffbot and want to use it with the client. Works well with :doc:`EntityFactory <class-entityfactory>`.
hr: :doc:`Custom API <api-custom>` - ako ste izgradili svoj API na Diffbotu, te ga zelite koristiti s klijentom. Dobro radi u tandemu s :doc:`EntityFactory klasom <class-entityfactory>`.

source: :doc:`Crawl API <api-crawl>` - if you want to apply any of the above on a massive number of URLs at once.
hr: :doc:`Crawl API <api-crawl>` - ako zelite primjeniti neki od gore navedenih API-ja na velik broj URLova odjednom.

source: :doc:`Search API <api-search>` - if you want to search the results produced by running the Crawl API above.
hr: :doc:`Search API <api-search>` - ako zelite pretraziti rezultate dobivene Crawl API-jem.

source: Whatever your goal, make sure you read the main :doc:`Diffbot file <01-diffbot>` first.
hr: Koji god API mislite koristiti, u svakom slucaju prvo prodjite kroz :doc:`Diffbot klasu <01-diffbot>`.
